// Generated by jextract

package com.virustotal.yara.binding;

import java.lang.invoke.MethodHandle;
import java.lang.invoke.VarHandle;
import java.nio.ByteOrder;
import java.lang.foreign.*;
import static java.lang.foreign.ValueLayout.*;
/**
 * {@snippet :
 * struct _YR_COMPILER {
 *     YR_ARENA* arena;
 *     uint32_t current_rule_idx;
 *     uint32_t next_rule_idx;
 *     uint32_t current_string_idx;
 *     uint32_t current_namespace_idx;
 *     uint32_t current_meta_idx;
 *     YR_RULES* rules;
 *     int errors;
 *     int current_line;
 *     int last_error;
 *     int last_error_line;
 *     jmp_buf error_recovery;
 *     YR_AC_AUTOMATON* automaton;
 *     YR_HASH_TABLE* rules_table;
 *     YR_HASH_TABLE* objects_table;
 *     YR_HASH_TABLE* strings_table;
 *     YR_HASH_TABLE* wildcard_identifiers_table;
 *     YR_HASH_TABLE* sz_table;
 *     YR_FIXUP* fixup_stack_head;
 *     int num_namespaces;
 *     YR_LOOP_CONTEXT loop[4];
 *     int loop_index;
 *     int loop_for_of_var_index;
 *     char* file_name_stack[16];
 *     int file_name_stack_ptr;
 *     char last_error_extra_info[256];
 *     char lex_buf[8192];
 *     char* lex_buf_ptr;
 *     unsigned short lex_buf_len;
 *     char include_base_dir[1024];
 *     void* user_data;
 *     void* incl_clbk_user_data;
 *     void* re_ast_clbk_user_data;
 *     YR_COMPILER_CALLBACK_FUNC callback;
 *     YR_COMPILER_INCLUDE_CALLBACK_FUNC include_callback;
 *     YR_COMPILER_INCLUDE_FREE_FUNC include_free;
 *     YR_COMPILER_RE_AST_CALLBACK_FUNC re_ast_callback;
 *     YR_ATOMS_CONFIG atoms_config;
 * };
 * }
 */
public class _YR_COMPILER {

    static final StructLayout $struct$LAYOUT = MemoryLayout.structLayout(
        Constants$root.C_POINTER$LAYOUT.withName("arena"),
        Constants$root.C_INT$LAYOUT.withName("current_rule_idx"),
        Constants$root.C_INT$LAYOUT.withName("next_rule_idx"),
        Constants$root.C_INT$LAYOUT.withName("current_string_idx"),
        Constants$root.C_INT$LAYOUT.withName("current_namespace_idx"),
        Constants$root.C_INT$LAYOUT.withName("current_meta_idx"),
        MemoryLayout.paddingLayout(32),
        Constants$root.C_POINTER$LAYOUT.withName("rules"),
        Constants$root.C_INT$LAYOUT.withName("errors"),
        Constants$root.C_INT$LAYOUT.withName("current_line"),
        Constants$root.C_INT$LAYOUT.withName("last_error"),
        Constants$root.C_INT$LAYOUT.withName("last_error_line"),
        MemoryLayout.sequenceLayout(1, MemoryLayout.structLayout(
            MemoryLayout.sequenceLayout(8, Constants$root.C_LONG_LONG$LAYOUT).withName("__jmpbuf"),
            Constants$root.C_INT$LAYOUT.withName("__mask_was_saved"),
            MemoryLayout.paddingLayout(32),
            MemoryLayout.structLayout(
                MemoryLayout.sequenceLayout(16, Constants$root.C_LONG_LONG$LAYOUT).withName("__val")
            ).withName("__saved_mask")
        ).withName("__jmp_buf_tag")).withName("error_recovery"),
        Constants$root.C_POINTER$LAYOUT.withName("automaton"),
        Constants$root.C_POINTER$LAYOUT.withName("rules_table"),
        Constants$root.C_POINTER$LAYOUT.withName("objects_table"),
        Constants$root.C_POINTER$LAYOUT.withName("strings_table"),
        Constants$root.C_POINTER$LAYOUT.withName("wildcard_identifiers_table"),
        Constants$root.C_POINTER$LAYOUT.withName("sz_table"),
        Constants$root.C_POINTER$LAYOUT.withName("fixup_stack_head"),
        Constants$root.C_INT$LAYOUT.withName("num_namespaces"),
        MemoryLayout.paddingLayout(32),
        MemoryLayout.sequenceLayout(4, MemoryLayout.structLayout(
            MemoryLayout.structLayout(
                Constants$root.C_INT$LAYOUT.withName("buffer_id"),
                Constants$root.C_INT$LAYOUT.withName("offset")
            ).withName("start_ref"),
            Constants$root.C_INT$LAYOUT.withName("vars_count"),
            MemoryLayout.paddingLayout(32),
            MemoryLayout.sequenceLayout(2, MemoryLayout.structLayout(
                Constants$root.C_INT$LAYOUT.withName("type"),
                MemoryLayout.paddingLayout(32),
                MemoryLayout.unionLayout(
                    Constants$root.C_LONG_LONG$LAYOUT.withName("integer"),
                    Constants$root.C_POINTER$LAYOUT.withName("object"),
                    MemoryLayout.structLayout(
                        Constants$root.C_INT$LAYOUT.withName("buffer_id"),
                        Constants$root.C_INT$LAYOUT.withName("offset")
                    ).withName("sized_string_ref")
                ).withName("value"),
                MemoryLayout.structLayout(
                    Constants$root.C_POINTER$LAYOUT.withName("ptr"),
                    MemoryLayout.structLayout(
                        Constants$root.C_INT$LAYOUT.withName("buffer_id"),
                        Constants$root.C_INT$LAYOUT.withName("offset")
                    ).withName("ref")
                ).withName("identifier")
            ).withName("_YR_EXPRESSION")).withName("vars"),
            Constants$root.C_INT$LAYOUT.withName("vars_internal_count"),
            MemoryLayout.paddingLayout(32)
        ).withName("_YR_LOOP_CONTEXT")).withName("loop"),
        Constants$root.C_INT$LAYOUT.withName("loop_index"),
        Constants$root.C_INT$LAYOUT.withName("loop_for_of_var_index"),
        MemoryLayout.sequenceLayout(16, Constants$root.C_POINTER$LAYOUT).withName("file_name_stack"),
        Constants$root.C_INT$LAYOUT.withName("file_name_stack_ptr"),
        MemoryLayout.sequenceLayout(256, Constants$root.C_CHAR$LAYOUT).withName("last_error_extra_info"),
        MemoryLayout.sequenceLayout(8192, Constants$root.C_CHAR$LAYOUT).withName("lex_buf"),
        MemoryLayout.paddingLayout(32),
        Constants$root.C_POINTER$LAYOUT.withName("lex_buf_ptr"),
        Constants$root.C_SHORT$LAYOUT.withName("lex_buf_len"),
        MemoryLayout.sequenceLayout(1024, Constants$root.C_CHAR$LAYOUT).withName("include_base_dir"),
        MemoryLayout.paddingLayout(48),
        Constants$root.C_POINTER$LAYOUT.withName("user_data"),
        Constants$root.C_POINTER$LAYOUT.withName("incl_clbk_user_data"),
        Constants$root.C_POINTER$LAYOUT.withName("re_ast_clbk_user_data"),
        Constants$root.C_POINTER$LAYOUT.withName("callback"),
        Constants$root.C_POINTER$LAYOUT.withName("include_callback"),
        Constants$root.C_POINTER$LAYOUT.withName("include_free"),
        Constants$root.C_POINTER$LAYOUT.withName("re_ast_callback"),
        MemoryLayout.structLayout(
            Constants$root.C_POINTER$LAYOUT.withName("get_atom_quality"),
            Constants$root.C_POINTER$LAYOUT.withName("quality_table"),
            Constants$root.C_INT$LAYOUT.withName("quality_warning_threshold"),
            Constants$root.C_INT$LAYOUT.withName("quality_table_entries"),
            Constants$root.C_BOOL$LAYOUT.withName("free_quality_table"),
            MemoryLayout.paddingLayout(56)
        ).withName("atoms_config")
    ).withName("_YR_COMPILER");
    public static MemoryLayout $LAYOUT() {
        return _YR_COMPILER.$struct$LAYOUT;
    }
    static final VarHandle arena$VH = $struct$LAYOUT.varHandle(MemoryLayout.PathElement.groupElement("arena"));
    public static VarHandle arena$VH() {
        return _YR_COMPILER.arena$VH;
    }
    /**
     * Getter for field:
     * {@snippet :
     * YR_ARENA* arena;
     * }
     */
    public static MemorySegment arena$get(MemorySegment seg) {
        return (java.lang.foreign.MemorySegment)_YR_COMPILER.arena$VH.get(seg);
    }
    /**
     * Setter for field:
     * {@snippet :
     * YR_ARENA* arena;
     * }
     */
    public static void arena$set(MemorySegment seg, MemorySegment x) {
        _YR_COMPILER.arena$VH.set(seg, x);
    }
    public static MemorySegment arena$get(MemorySegment seg, long index) {
